# Pratik Joshi 
# Div: B 
# Computer engineering
# clg: Keystone school of engineering

In [1]:
import numpy as np ## array operations

In [2]:
import pandas as pd # structured data analysis

In [3]:
df1 = pd.read_csv('student.csv')

In [4]:
df1.iloc[3,1]

'ajinkya'

In [5]:
x = df1.iloc[4:9]
print(x)

   roll    name class  marks  age
4     5    asha    TE  63.28   20
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20

In [6]:
df1.iloc[:,3]

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [7]:
type(x)

pandas.core.frame.DataFrame

In [8]:
df1.iloc[:4]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20

In [9]:
df1.iloc[[5,7,2,1],[1,3,]]

     name  marks
5  ayesha  49.55
7   amita  68.33
2  aniket  76.88
1    amit  59.77

In [10]:
df1

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [11]:
df1.iloc[1:9,:4]

   roll     name class  marks
1     2     amit    TE  59.77
2     3   aniket    BE  76.88
3     4  ajinkya    TE  69.66
4     5     asha    TE  63.28
5     6   ayesha    BE  49.55
6     7     amar    BE  65.34
7     8    amita    BE  68.33
8     9     amol    TE  56.75

In [12]:
df1.iloc[4:9,:3]

   roll    name class
4     5    asha    TE
5     6  ayesha    BE
6     7    amar    BE
7     8   amita    BE
8     9    amol    TE

In [13]:
df1.iloc[6,4]

19

In [14]:
df1.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [15]:
df1['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [18]:
df1[['name','marks','age']]

      name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

In [20]:
df1.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [21]:
df1.marks

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [23]:
df1.iloc[0:5]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [25]:
df1.iloc[list(range(5))+list(range(6,10))]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [27]:
df1.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [29]:
df1

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [30]:
df1.drop([5,8,2])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [32]:
df1.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

# functions / Methods

In [35]:
df1['marks'].mean()

64.499

In [36]:
df1['marks'].min()

49.55

In [37]:
df1['marks'].max()

78.66

In [38]:
df1['name'].max()

'ayesha'

In [39]:
df1['name'].min()

'ajinkya'

In [40]:
df1['name'].sum()

'anilamitaniketajinkyaashaayeshaamaramitaamolanmol'

In [41]:
df1['marks'].sum()

644.9899999999999

In [42]:
df1['age'].min()

19

In [43]:
df1['age'].max()

23

In [44]:
df1['marks'].median()

64.31

In [46]:
df1['marks'].std()

9.207178901994535

In [48]:
df1['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [49]:
df1['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [50]:
df1['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [52]:
df1['age'].mode()

0    20
Name: age, dtype: int64

In [53]:
df1['marks'].mode()

0    49.55
1    56.75
2    56.77
3    59.77
4    63.28
5    65.34
6    68.33
7    69.66
8    76.88
9    78.66
Name: marks, dtype: float64

In [55]:
df1['class'].count()

10

In [57]:
df1.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [58]:
df1.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [62]:
df1.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [63]:
df1.median(numeric_only=True)

roll      5.50
marks    64.31
age      20.00
dtype: float64

In [64]:
df1.mode(numeric_only=True)

   roll  marks   age
0     1  49.55  20.0
1     2  56.75   NaN
2     3  56.77   NaN
3     4  59.77   NaN
4     5  63.28   NaN
5     6  65.34   NaN
6     7  68.33   NaN
7     8  69.66   NaN
8     9  76.88   NaN
9    10  78.66   NaN

In [65]:
df1.std(numeric_only=True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [66]:
df1.mean(numeric_only=True, axis = 1)

0    26.590000
1    27.590000
2    32.960000
3    31.220000
4    29.426667
5    25.183333
6    30.446667
7    33.110000
8    28.583333
9    36.553333
dtype: float64

In [68]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [70]:
df1.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000